# Created 2025-06-17 Tue 12:56
#+title: Cryptography
#+author: Jesse Oldroyd
Lectures for mathematics summer gifted program.
* <2025-06-16 Mon>
- Python code for substitution cipher:
#+begin_src python :results output :session yes :exports both
  import random

  letters = list('abcdefghijklmnopqrstuvwxyz')
  letters_cipher = letters.copy()
  random.shuffle(letters_cipher)

  encryption_key = {}
  decryption_key = {}
  for l1, l2 in zip(letters, letters_cipher):
      encryption_key[l1] = l2
      decryption_key[l2] = l1

  def substitution_encrypt(plaintext, encryption_key):
      plaintext = plaintext.lower()
      ciphertext = ""

      for letter in plaintext:
          if letter in encryption_key.keys():
              ciphertext += encryption_key[letter]
          else:
              ciphertext += letter

      return ciphertext

  def substitution_decrypt(ciphertext, decryption_key):
      ciphertext = ciphertext.lower()
      plaintext = ""

      for letter in ciphertext:
          if letter in decryption_key.keys():
              plaintext += decryption_key[letter]
          else:
              plaintext += letter

      return plaintext

  message = "This is my message."
  encrypted_message = substitution_encrypt(message, encryption_key)
  decrypted_message = substitution_decrypt(encrypted_message, decryption_key)

  print(f"Message: {message}")
  print(f"Ciphertext: {encrypted_message}")
  print(f"Plaintext: {decrypted_message}")
#+end_src

#+results: 
: Message: This is my message.
: Ciphertext: ifbk bk se sukkwxu.
: Plaintext: this is my message.


- [[https://pi.math.cornell.edu/~mec/2003-2004/cryptography/subs/frequencies.html][Frequency diagram]] for letters of the English language.

- *Example*: The following message has been encrypted using a substitution
  cipher: 'ykbk nk vbk, og pijlyvggcg, nktz qobaogov.'
  Decrypt this message.

  /Answer/: The frequency diagram above gives us some clues as to what each
  letter could represent.  In particular, since ~e~ is the most common letter
  of the English alphabet and ~g~ and ~k~ are frequent letters in the above
  message, we can try to replace either of these letters (but not both!) with
  ~e~:
  #+begin_src python :session yes :exports both
    ciphertext = 'ykbk nk vbk, og pijlyvggcg, nktz qobaogov'
    decrypt2 = {'k':'e'} # Try replacing k with e
    substitution_decrypt(ciphertext, decrypt2)
  #+end_src

  #+results: 
  : yebe ne vbe, og pijlyvggcg, netz qobaogov


  Since the first word becomes ~yebe~, we now look for a four-letter word in
  English that has an ~e~ in the second and last entries.  One example, after
  some trial and error, is ~here~.  So now we try replacing ~y~ with ~h~ and
  ~b~ with ~r~:
  #+begin_src python :session yes :exports both
    decrypt2['y'] = 'h'
    decrypt2['b'] = 'r'
    substitution_decrypt(ciphertext, decrypt2)
  #+end_src

  #+results: 
  : here ne vre, og pijlhvggcg, netz qoraogov


  Now the first phrase in this message looks like it could be "here we are",
  and so we continue with these substitutions:
  #+begin_src python :session yes :exports both
    decrypt2['n'] = 'w'
    decrypt2['v'] = 'a'
    substitution_decrypt(ciphertext, decrypt2)
  #+end_src

  #+results: 
  : here we are, og pijlhaggcg, wetz qoraogoa


  A natural word that follows the phrase "here we are" is "in", so once again
  we add those letters to our key:
  #+begin_src python :session yes :exports both
    decrypt2['o'] = 'i'
    decrypt2['g'] = 'n'
    substitution_decrypt(ciphertext, decrypt2)
  #+end_src

  #+results: 
  : here we are, in pijlhanncn, wetz qirainia


  A little bit more trial and error gives the (likely) decrypted message:
  "here we are, in Buckhannon, West Virginia".
